export const conceptLevelData = [
  {
    name: "강의",
    array: [
      "쉽게 따라갈 수 있는 강의를 학교, 학원, 인강 중 선택해서 30분씩이라도 들으면 훨씬 개념 이해가 잘될거야.",
      "강의 듣는게 조금 힘들면 이해가 잘 안되는 부분은 체크해두고 다시 반복해서 듣거나 질문을 해서 확실하게 해두자!!",
      "강의내용이 좋아서 이해가 되더라도 복습이 없으면 까먹게 마련이지. 복습 또 복습!!",
    ],
  },
  {
    name: "정독",
    array: [
      "개념서를 볼때 단원명, 목차부터 그냥 편하게 한번 주욱 읽어보는게 필요해",
      "공부할 내용 중 어렵거나 중요한 내용은 한번 더 체크하고 다시 볼수록 이해가 쉬워져요.",
      "공부했던 내용을 다시 떠올려보면서 놓치고 있었거나 잘못 알고 있었던 개념을 바로 잡아내야해.",
    ],
  },
  {
    name: "노트정리",
    array: [
      "수업내용을 그대로 받아적는 것이 공부와 친해지는 가장 쉬운 방법이야. 잊지마!!",
      "색깔펜이나 포스트잇을 사용해서 중요 내용이나 질문내용을 글씨 크기나 숫자, 기호로 나만의 방식을 만들어야 해.",
      "소단원명이나 목차를 적은 후 지금까지 공부한 내용을 혼자서 정리할 수 있어야 선수지!",
    ],
  },
  {
    name: "암기",
    array: [
      "암기가 공부에서 훌륭한 1단계 비법이라는 걸 왜 모르지? 귀찮아도 외워봅시다~",
      "한번에 완벽히 외울 수는 없지. 까먹었더라도 페이지를 넘겨야 해. 반복해서 암기하다보면 어느새~~",
      "내가 다 알고 있다고 착각하면 안되지. 제대로 알고 있는 지 암기한 내용을 꼭 테스트 해봐야해!",
    ],
  },
  {
    name: "안 함",
    array: ["", "", ""],
  },
];

export const questionLevelData = [
  {
    name: "기본문제",
    array: [
      "개념을 확인하는 가장 쉬운 기본 문제부터 빠트리지 않고 전부 풀어야 해. 사실 처음엔 이것도 쉽지 않아.",
      "기본문제를  답지를 안보고 풀 수 있는 지 확인하면서 80% 이상이 되면 다음단계로 고고!!",
      "기본문제여도 공부하다보면 까먹는 게 의외로 많다는 걸 잊지마!! 정답률이 100%가 나와야 해.",
    ],
  },
  {
    name: "문졔+채점",
    array: [
      "푼 문제는 반드시 채점을 하고 고친 문제는 다르게 채점해서 복습할 때 쉽게 구분할 수 있어야해.",
      "내가 모르는 것과 간단한 실수로 틀린 것은 색깔이나 기호나 숫자를 사용해서 표식으로 꼭 구분해서 채점해야해.",
      "반복해서 푼 문제는 횟수를 표시하고 이해도를 %로 표시해서 확실하게 알고있는 지 구분해서 최종 채점을 해야지!!",
    ],
  },
  {
    name: "문제+오답분석",
    array: [
      "정답률이 80%이상인 문제부터 오답분석을 꼼꼼하게 해서 100%로 만들고나서 80%미만문제를 분석하는 게 순서지~",
      "틀린문제는 해설을 보고 이해가 되었더라도 오답인 이유를 개념착각인지 내용을 몰라서인지 구분해서 분석해야해!!",
      "문제를 풀 때 분위기나 상황도 생각해보고 시간에 쫓겨서 불안한 멘탈적인 이유는 없었는지 하나씩 더 살펴보자~ ",
    ],
  },
  {
    name: "오답유형분석",
    array: [
      "오답도 반복해서 틀리는 유형이 있거든. 그게 내가 부족한 부분이니까 좀 더 반복해서 공부해야겠지!",
      "오답이 나온 유형의 문제를 찾아서 익숙해질 때까지 반복해서 풀어보고 고쳐나가는 게 공부지~",
      "오답이 나왔던 문제와 비슷한 유형의 문제에서 다른 부분이 무엇인지 하나씩 체크하고 비교할 수 있어야 선수지!!",
    ],
  },
  {
    name: "안 함",
    array: ["", "", ""],
  },
];

export const advancedLevelData = [
  {
    name: "기출문제",
    array: [
      "기출문제는 반드시 풀어봐야 해. 출제 유형을 알아야 공부 수준과 난이도를 어느 정도로 준비해야할 지 감이 오거든.",
      " 해마다 샘이나 출제 경향이 바뀔 수 있다는 걸 명심하고, 기출문제는 2~3개년치는 풀어야해!!",
      "기출문제에만 너무 의존하면 내가 놓치고 있는 내용을 채울 시간이 부족하니까 놓친 문제를 좀더 공부해야해!!",
    ],
  },
  {
    name: "심화개념",
    array: [
      "쉬운 개념일수록 다 알고 있다고 착각할 수 있지. 대충 아는 것은 오히려 틀린 개념일 수 있어. 하나씩 제대로 확인할 것!!",
      "문제를 풀다보면 난이도를 조금 높여서 공부해야하는 순간이 오거든. 이때 개념을 다른 교재로 한번 더 구석구석 보면 자신감이 생겨날거야~",
      "개념을 완벽하게 이해하려면 꼭 혼자서 바로바로 떠올릴 수 있는 지 테스트해봐야해. 안된다면 다시 개념을 정리한 후에 확인!!",
    ],
  },
  {
    name: "고난도문제풀이",
    array: [
      "처음부터 고난도 문제를 풀 수 없는 건 당연하지. 우선 해설을 참고해서 그대로 노트해보고 2회 정도는 반복!!",
      "고난도 문제는 다른 문제집에서도 비슷한 유형을 보게 될거야. 해설강의도 듣고 3회이상 반복해서 외워질 때까지 풀다보면 어느새 실력이 업!!",
      "풀 수 있는 고난도문제에서 필요한 것들을 하나씩 찾아가면서 공부해야 변형문제도 풀 수 있는 능력이 생겨날거야. 똑같은 문제로 출제되는 건 드물거든.",
    ],
  },
  {
    name: "신유형문제",
    array: [
      "신유형문제는 기존 문제를 변형해서 나온 거니까 풀이가 명확하지 않을 수 있거든. 그러니까 질문이나 강의로 해결하는 게 조금 더 편할거야.",
      "신유형이나 변형문제도 겁먹지말고 도전해서 풀어보고 다른 참고서나 강의를 찾아서 반복학습을 하면 해결할 수 있어.",
      "신유형문제도 또 다른 변형을 할 수 있으니까 너무 신유형만 집중하지말고 기출문제 유형과 차이점을 분석하면서 스스로 문제를 분석해야 진짜 선수지!!",
    ],
  },
  {
    name: "안 함",
    array: ["", "", ""],
  },
];

export const actualLevelData = [
  {
    name: "기출문제",
    array: [
      "최근 출제되고 있는 유형의 기출문제인지 확인해야 공부했던 내용을 제대로 비교할 수 있지~",
      "기출문제 수준이 지나치게 높거나 차이가 나면 주눅들지말고 현재 해결할 수 있는 수준의 문제와 내용 확인학습을 먼저 해야 돼!!",
      "기출문제에 지나치게 의존하지말고 꼼꼼하게 조금 강도를 높여서 공부를 해야 돼!! 난이도와 출제방식은 언제나 바뀔 수 있거든.",
    ],
  },
  {
    name: "기출문제+시간test",
    array: [
      "시간을 재서 풀었을때 평균시간을 계산해봐야해! 어느정도 내 실력을 알아볼 수 있거든.시간이 많이 든 문제가 현재 풀 수 있는 유형인지 확인해봐",
      " 기출문제가 완벽히 기억난다고 할지라도 시간을 재서 풀어보고 정답을 확인해봐~답이 맞았더라도 풀이가 확실한지 확인해봐야 돼~",
      " 평소 시험시간보다 10분 정도 짧게 잡아서 연습해야 실전에서 돌발상황이나 불안도를 반영해서 체크해볼 수 있어~",
    ],
  },
  {
    name: "모의실전test",
    array: [
      "실전예상문제를 풀면 반드시 채점하고 오답분석을 해야돼!! 눈으로만 이해하는 것은 절대 금물!!",
      "실전예상문제를  2회이상 풀고 부족한 부분을 찾아서 우선 해결할 수 있는 것부터 충분히 연습하길~조급해하지말고!!",
      "기존에 공부한 유형과 다른 부분을 찾아서 해결할 수 있는 방법을 마련해봐. 가령 몰라서 찍어야 하는 상황을 포함해서~",
    ],
  },
  {
    name: "모의실전+시간test",
    array: [
      "동일한 시험 시간내에 풀었을때 점수가 높았던 이유와 그렇지 않은 이유를 찾아봐야해! 실전 상황에서 생기는 원인을 알아야 해결할 수 있지~",
      "시험시간대와 장소를 다르게 해서 문제를 풀어보는 것을 강추~집중이 잘되는 시간대와 장소가 다를 수 있거든. 혼자, 그룹, 집,학원, 스터디까페 등",
      "오답분석을 할때 최근 출제 경향과 비교해보고 자신의 약점상황이 모두 해결 되었는지 점검해봐.  시험볼때 상황을 떠올려서 자신의 마음상태를 적어보면 도움이 될거야~",
    ],
  },
  {
    name: "안 함",
    array: ["", "", ""],
  },
];

export const subjectData = [
  "과학",
  "영어",
  "수학",
  "국어",
  "사회",
  "제2외국어",
];

export const amountData = [
  "30% 미만",
  "60% 미만",
  "80% 미만",
  "90% ~ 100% 미만",
  "100%",
];

export const conceptData = ["강의", "정독", "암기", "노트정리", "안 함"];

export const questionData = [
  "기본문제",
  "문제+채점",
  "문제+오답분석",
  "오답유형분석",
  "안 함",
];
export const advancedData = [
  "기출문제",
  "심화개념",
  "고난도문제풀이",
  "신유형문제",
  "안 함",
];
export const actualData = [
  "기출문제",
  "기출문제+시간test",
  "모의실전test",
  "모의실전+시간test",
  "안 함",
];
