// TODO : 추후 express에서 시작 시 fs로 받아오는 로직 추가 할 것

export const ebti1QuestData = [
  {
    id: 1,
    title:
      "학습을 더 잘하기 위한 방법들을 기억해 두었다가, 필요할 때 마다 활용한다.",
    type: "키움형",
    subtype: "변화",
  },
  {
    id: 2,
    title: "문제 상황이 생겼을 때, 변화를 추구하거나 비판한다.",
    type: "키움형",
    subtype: "변화",
  },
  {
    id: 3,
    title: "새로운 것에 대한 호기심이 많다.",
    type: "키움형",
    subtype: "변화",
  },
  {
    id: 4,
    title:
      "토론, 발표, 글쓰기, 미술, 음악, 발명 등 실습이나 실기를 좋아하는 편이다.",
    type: "돋움형",
    subtype: "예술",
  },
  {
    id: 5,
    title: "예술분야(미술, 음악, 문학 등)에 관심이 많다.",
    type: "돋움형",
    subtype: "예술",
  },
  {
    id: 6,
    title: "나는 배우는 과정 자체가 즐겁기 때문에 공부한다.",
    type: "돋움형",
    subtype: "예술",
  },
  {
    id: 7,
    title: "규칙적이고 반복적인 활동을 선호한다.",
    type: "채움형",
    subtype: "체계",
  },
  {
    id: 8,
    title: "모두에게 공평한 기회를 주는 선생님을 선호한다.",
    type: "채움형",
    subtype: "체계",
  },
  {
    id: 9,
    title: "조직적이고 안정적이며 체계적인 일을 좋아한다.",
    type: "채움형",
    subtype: "체계",
  },
  {
    id: 10,
    title: "어떤 일에 대해 미리 준비하고 대비하는 성향이 강하다.",
    type: "채움형",
    subtype: "대비",
  },
  {
    id: 11,
    title:
      "나의 진로에 대해 워크넷, 커리어넷 같은 사이트를 통해 정보를 얻는다.",
    type: "채움형",
    subtype: "대비",
  },
  {
    id: 12,
    title: "시험일정이 있어야 공부할 때 집중하는 편이다.",
    type: "채움형",
    subtype: "대비",
  },
  {
    id: 13,
    title:
      "다른 사람에게 가르쳐 줄 수 있을 정도로 이해했는지 확인하며 공부한다.",
    type: "세움형",
    subtype: "조화",
  },
  {
    id: 14,
    title:
      "남들이 내 의견에 동의하지 않을 때에도 항상 다른 사람의 의견을 받아들인다.",
    type: "세움형",
    subtype: "조화",
  },
  {
    id: 15,
    title:
      "학습상황에서 문제가 생겼을 때 부모님, 선생님의 의견에 따라 원인을 찾아서 해결하는 편이다.",
    type: "세움형",
    subtype: "조화",
  },
  {
    id: 16,
    title:
      "돌발 상황에서 대부분 논리적이고 합리적인 사고를 통해 문제를 해결하려 한다.",
    type: "키움형",
    subtype: "합리",
  },
  {
    id: 17,
    title:
      "선생님이나 친구들과 공부의 어려움을 편하게 이야기 할 때 공부가 잘 된다.",
    type: "키움형",
    subtype: "합리",
  },
  {
    id: 18,
    title: "나의 실수를 정확하게 지적해 주는 사람이 좋다.",
    type: "키움형",
    subtype: "합리",
  },
  {
    id: 19,
    title: "자신만의 개성이 뚜렷하다.",
    type: "돋움형",
    subtype: "자아",
  },
  {
    id: 20,
    title: "나의 관심사나 희망진로에 관심을 가져주는 선생님이 좋다.",
    type: "돋움형",
    subtype: "자아",
  },
  {
    id: 21,
    title: "새로 배우는 내용에서 나만의 원리나 규칙을 찾으려고 노력한다.",
    type: "돋움형",
    subtype: "자아",
  },
  {
    id: 22,
    title: "숫자나 그래프를 이용하는 일이 편하다.",
    type: "돋움형",
    subtype: "분석",
  },
  {
    id: 23,
    title:
      "나의 강점이나 약점에 대해서 자세히 알고 이해해주는 선생님을 원한다.",
    type: "돋움형",
    subtype: "분석",
  },
  {
    id: 24,
    title:
      "새롭게 이해한 내용을 이미 알고 있는 내용에 적용해 볼 수 있을지 생각하며 공부한다.",
    type: "돋움형",
    subtype: "분석",
  },
  {
    id: 25,
    title: "맡은 일에 대한 책임감이 있어 일을 끝까지 해내는 편이다.",
    type: "채움형",
    subtype: "책임",
  },
  {
    id: 26,
    title: "학교에서 과제나 수행평가 기한을 잘 지키는 편이다.",
    type: "채움형",
    subtype: "책임",
  },
  {
    id: 27,
    title: "원리나 규칙을 완전히 이해할 때까지 공부하는 것을 좋아한다.",
    type: "채움형",
    subtype: "책임",
  },
  {
    id: 28,
    title:
      "어떤 주제에 대해 공부할 때, 목표를 중심으로 목차구조를 파악한 뒤 학습한다.",
    type: "세움형",
    subtype: "목표",
  },
  {
    id: 29,
    title: "리더십으로 다른 사람들을 이끄는 것을 좋아한다.",
    type: "세움형",
    subtype: "목표",
  },
  {
    id: 30,
    title: "목표를 설정하고 추진하는 일에 자신이 있다.",
    type: "세움형",
    subtype: "목표",
  },
  {
    id: 31,
    title: "나는 모르는 것을 알아가는 것이 즐겁기 때문에 공부한다.",
    type: "키움형",
    subtype: "탐색",
  },
  {
    id: 32,
    title:
      "같은 주제여도 내 수준에 적합한 난이도를 선택해서 공부하는 것이 좋다.",
    type: "키움형",
    subtype: "탐색",
  },
  {
    id: 33,
    title: "내용을 이해하기 위해 자료 수집 등의 노력을 기울인다.",
    type: "키움형",
    subtype: "탐색",
  },
  {
    id: 34,
    title: "말수가 적으며 사교적이지 않은 편이다.",
    type: "채움형",
    subtype: "현실",
  },
  {
    id: 35,
    title: "현실적이고 실제적인 것에 영향을 받는다.",
    type: "채움형",
    subtype: "현실",
  },
  {
    id: 36,
    title: "단원 순서를 지켜가며 공부하는 것이 좋다.",
    type: "채움형",
    subtype: "현실",
  },
  {
    id: 37,
    title: "직접 느끼고 움직이는 체험을 중시한다.",
    type: "키움형",
    subtype: "조작",
  },
  {
    id: 38,
    title: "손이나 도구를 사용하는 조작을 즐겨한다.",
    type: "키움형",
    subtype: "조작",
  },
  {
    id: 39,
    title: "어떤 대상이나 기계, 동식물을 조작하는 활동에 관심을 둔다.",
    type: "키움형",
    subtype: "조작",
  },
  {
    id: 40,
    title: "타인의 감정을 잘 이해하며 배려심을 가지고 행동한다.",
    type: "세움형",
    subtype: "감정",
  },
  {
    id: 41,
    title: "어려움에 처해있는 사람들을 그냥 지나치지 못한다.",
    type: "세움형",
    subtype: "감정",
  },
  {
    id: 42,
    title: "감정이 상하지 않도록 배려하는 어투를 사용하는 선생님을 선호한다.",
    type: "세움형",
    subtype: "감정",
  },
  {
    id: 43,
    title:
      "나는 선생님이나 친구들과 주제탐구에 관련된 다양한 활동을 좋아하는 편이다.",
    type: "돋움형",
    subtype: "활동",
  },
  {
    id: 44,
    title: "이미 알고 있는 내용이나 새롭게 배운 내용을 알려주고 싶어한다.",
    type: "돋움형",
    subtype: "활동",
  },
  {
    id: 45,
    title: "깊게 탐구하는 과정을 즐긴다.",
    type: "돋움형",
    subtype: "활동",
  },
  {
    id: 46,
    title:
      "성적이 떨어졌을 때, 새로운 공부의 방향은 부모님 또는 선생님의 말씀을 따르는 편이다 ",
    type: "채움형",
    subtype: "조언",
  },
  {
    id: 47,
    title:
      "나의 부족함을 지적해 주시는 선생님의 말씀을 들으면 어떻게 공부해야 할지 알게 되어 좋다.",
    type: "채움형",
    subtype: "조언",
  },
  {
    id: 48,
    title: "구체적이고 명확한 일이나 공부를 선호한다.",
    type: "채움형",
    subtype: "조언",
  },
  {
    id: 49,
    title: "나만의 아이디어를 생각하는 일을 즐긴다.",
    type: "돋움형",
    subtype: "창의",
  },
  {
    id: 50,
    title: "감정을 솔직하고 자유롭게 표현한다.",
    type: "돋움형",
    subtype: "창의",
  },
  {
    id: 51,
    title: "창의성을 발휘할 수 있는 주제에 흥미를 느낀다.",
    type: "돋움형",
    subtype: "창의",
  },
  {
    id: 52,
    title: "사람들과 잘 어울리고 사교적인 모습을 보인다.",
    type: "세움형",
    subtype: "타인",
  },
  {
    id: 53,
    title: "혼자 일하기보다 함께 일하는 것을 즐긴다.",
    type: "세움형",
    subtype: "타인",
  },
  {
    id: 54,
    title: "다른 사람을 설득하고 토론 및 논쟁을 즐긴다.",
    type: "세움형",
    subtype: "타인",
  },
  {
    id: 55,
    title: "어떤 주제에 대해 공부할 때, 한 번에 한 가지 내용에 집중한다.",
    type: "세움형",
    subtype: "주제",
  },
  {
    id: 56,
    title: "중요한 시험을 준비할 때, 공부 시작 전 미리 신중하게 계획을 세운다.",
    type: "세움형",
    subtype: "주제",
  },
  {
    id: 57,
    title:
      "새롭게 배우는 내용들 사이에 서로 어떤 관계가 있는지 확인하며 공부한다.",
    type: "세움형",
    subtype: "주제",
  },
  {
    id: 58,
    title: "새로 배우는 내용에서 나만의 원리나 규칙을 찾으려고 노력한다.",
    type: "키움형",
    subtype: "주체",
  },
  {
    id: 59,
    title:
      "경험을 먼저 해본 후, 나만의 공부 방법을 기분에 따라 선택하는 것이 좋다.",
    type: "키움형",
    subtype: "주체",
  },
  {
    id: 60,
    title:
      "선생님이 추천하는 학습법을 내 것으로 바꾸어 계획적으로 활용할 때, 잘 집중할 수 있다.",
    type: "키움형",
    subtype: "주체",
  },
];
